package homework4.ex1;

import java.util.ArrayList;
import java.util.List;
import java.util.stream.Collectors;
import java.util.stream.Stream;

public class Runner {
    public static void main(String[] args) {
        //ИСПОЛЬЗОВАНИЕ FOR, WHILE ЗАПРЕЩЕНО В ЭТОЙ ДЗ! Только СТРИМЫ.
        //Задание №1 - Список спец номеров
        //Нам необходимо распечатать список номеров, которые принадлежат чиновникам
        //1. Создать класс машина. У машины есть номер.
        List<Car> carList1 = Stream
                .iterate(1, i -> i + 1)
                .limit(50)
                .map(i -> new Car(i < 10 ? "a00" + i + "ан799" : "a0" + i + "ан799"))
                .toList();
        List<Car> carList2 = Stream
                .iterate(1, i -> i + 1)
                .limit(50)
                .map(i -> new Car(i < 10 ? "к00" + i + "се178" : "к0" + i + "се178"))
                .toList();
        //2. Создать 50 машин с номерами а0[01-50]ан799 (где [01-50] - это все значения от 01 до 50)
        //3. Создать 50 машин с номерами к0[01-50]се178 (где [01-50] - это все значения от 01 до 50)
        //4. Объединить машины в единый стрим
        //5. Оставить в объединенном стриме машины с номерами 04[0-9] - это номера, выдаваемые чиновникам
        //6. Получить из оставшихся машин номера.
        //7. Распечатать номера.
        //ожидаемый результат:
        // a040ан799
        // a041ан799
        // ...
        // k048се178
        // k049се178
    }
}
